app/views/statuses/index.html.erb

SELECT COUNT(*) FROM "contacts" WHERE "contacts"."status_id" = ?  [["status_id", 7]]
---
<div class="col-md-12">
  <% @statuses.select {|status| status.contacts.count >= 0}.each do |status| %>