app/views/contacts/index.html.erb

      <tr>
        <td><%= Status.find_by(contact.status_id).value %></td>
---
SELECT  "statuses".* FROM "statuses" WHERE "statuses"."contact_id" = ? LIMIT 1  [[nil, 1]]