app/controllers/about_controller.rb

  def index

  	@contacts = current_user.contacts.all
  	@statuses = current_user.statuses.all
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = ?  [["user_id", 2]]
SELECT "contacts".* FROM "contacts" WHERE "contacts"."status_id" = ?  [["status_id", 7]]
SELECT "statuses".* FROM "statuses" WHERE "statuses"."user_id" = ?  [["user_id", 2]]