app/controllers/contacts_controller.rb

  def index
    @contacts = current_user.contacts.all
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = ?  [["user_id", 2]]

  def show
    @status_id = @contact.status_id
    @status = Status.where(status_id: @status_id)
    @status_name = @status.value
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."status_id" = 9
SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", 3]]

  def new
    @contact = Contact.new
    @statuses = current_user.statuses.all
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."user_id" = ?  [["user_id", 2]]

  def create
    @contact = current_user.contacts.build(contact_params)
    @contact.save
---
INSERT INTO "contacts" ("status_id", "value", "name", "note", "assigned_to", "email", "phone", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @contact.update(contact_params)
---
UPDATE "contacts" SET "name" = ?, "email" = ?, "phone" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["name", "Lorenzojjjj"], ["email", "lasslo.net@gmail.com"], ["phone", "45469"], ["updated_at", "2015-01-13 10:19:56.220615"], ["id", 17]]