app/controllers/registrations_controller.rb

  def create
     super
    if @user.save

      #sign in and verify user

      sign_in @user
      @user = current_user

      Status.create(value: 'Lead', user_id: @user.id)
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
UPDATE "users" SET "last_sign_in_at" = ?, "current_sign_in_at" = ?, "last_sign_in_ip" = ?, "current_sign_in_ip" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = ?
INSERT INTO "statuses" ("value", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["value", "Lead"], ["user_id", 1], ["created_at", "2015-01-12 18:06:27.100182"], ["updated_at", "2015-01-12 18:06:27.100182"]]