app/controllers/statuses_controller.rb

SELECT "statuses".* FROM "statuses" WHERE "statuses"."user_id" = ?  [[nil, 3]]
---
  def index
    @statuses = current_user.statuses.all

INSERT INTO "statuses" ("value", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["value", "Lead"], ["user_id", 2], ["created_at", "2015-01-12 17:13:52.233858"], ["updated_at", "2015-01-12 17:13:52.233858"]]
---
  def create
    @status = current_user.statuses.build(status_params)
    @status.save

UPDATE "statuses" SET "value" = ?, "updated_at" = ? WHERE "statuses"."id" = ?  [["value", "Negotiations"], ["updated_at", "2015-01-13 16:23:08.477688"], ["id", 9]]
---
  def update
    @status.update(status_params)

DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 1]]
---
  def destroy
    @status.destroy